
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 1 to change, 7 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.POSTGRES_HOST-V15
* Replace
  * module.notifications-service-database-v15.azurerm_postgresql_flexible_server.pgsql_server
  * module.notifications-service-database-v15.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.notifications-service-database-v15.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.notifications-service-database-v15.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]
  * module.notifications-service-database-v15.azurerm_postgresql_flexible_server_database.pg_databases[&#34;notifications&#34;]
  * module.notifications-service-database-v15.azurerm_resource_group.rg[0]
  * module.notifications-service-database-v15.null_resource.set-user-permissions-additionaldbs[&#34;notifications&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES_HOST-V15 will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST-V15" {
        id                      = "https://ccpay-aat.vault.azure.net/secrets/notifications-service-POSTGRES-HOST-V15/42e6cbcc6d8d409ab236b18274824462"
        name                    = "notifications-service-POSTGRES-HOST-V15"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.notifications-service-database-v15.azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      ~ fqdn                          = "ccpay-postgres-db-v15-aat.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccpay-postgres-db-v15-aat" -> (known after apply)
      ~ name                          = "ccpay-postgres-db-v15-aat" -> "ccpay-notifications-service-postgres-db-v15-aat" # forces replacement
      ~ public_network_access_enabled = false -> (known after apply)
      ~ resource_group_name           = "ccpay-postgres-db-v15-data-aat" -> "ccpay-notifications-service-postgres-db-v15-data-aat" # forces replacement
        tags                          = {
            "application"         = "fees-and-payments"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/ccpay-notifications-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#cc-payments"
            "environment"         = "staging"
            "managedBy"           = "Fees/Pay"
        }
      - zone                          = "2" -> null
        # (12 unchanged attributes hidden)

      ~ high_availability {
          - standby_availability_zone = "1" -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.notifications-service-database-v15.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin must be replaced
-/+ resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      ~ id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccpay-postgres-db-v15-aat/administrators/e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply)
      ~ resource_group_name = "ccpay-postgres-db-v15-data-aat" -> "ccpay-notifications-service-postgres-db-v15-data-aat" # forces replacement
      ~ server_name         = "ccpay-postgres-db-v15-aat" -> "ccpay-notifications-service-postgres-db-v15-aat" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.notifications-service-database-v15.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      ~ id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccpay-postgres-db-v15-aat/administrators/ca6d5085-485a-417d-8480-c3cefa29df31" -> (known after apply)
      ~ resource_group_name = "ccpay-postgres-db-v15-data-aat" -> "ccpay-notifications-service-postgres-db-v15-data-aat" # forces replacement
      ~ server_name         = "ccpay-postgres-db-v15-aat" -> "ccpay-notifications-service-postgres-db-v15-aat" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.notifications-service-database-v15.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.extensions"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccpay-postgres-db-v15-aat/configurations/azure.extensions" -> (known after apply)
        name      = "azure.extensions"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccpay-postgres-db-v15-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.notifications-service-database-v15.azurerm_postgresql_flexible_server_database.pg_databases["notifications"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccpay-postgres-db-v15-aat/databases/notifications" -> (known after apply)
        name      = "notifications"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/ccpay-postgres-db-v15-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.notifications-service-database-v15.azurerm_resource_group.rg[0] must be replaced
-/+ resource "azurerm_resource_group" "rg" {
      ~ id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-postgres-db-v15-data-aat" -> (known after apply)
      ~ name     = "ccpay-postgres-db-v15-data-aat" -> "ccpay-notifications-service-postgres-db-v15-data-aat" # forces replacement
        tags     = {
            "application"         = "fees-and-payments"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/ccpay-notifications-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#cc-payments"
            "environment"         = "staging"
            "managedBy"           = "Fees/Pay"
        }
        # (1 unchanged attribute hidden)
    }

  # module.notifications-service-database-v15.null_resource.set-user-permissions-additionaldbs["notifications"] must be replaced
-/+ resource "null_resource" "set-user-permissions-additionaldbs" {
      ~ id       = "4954905153478752922" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "name"           = "ccpay-postgres-db-v15" -> "ccpay-notifications-service-postgres-db-v15"
            # (2 unchanged elements hidden)
        }
    }

Plan: 7 to add, 1 to change, 7 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":242,"Program":"tfcmt","SHA1":"","Vars":{}} -->